openness_example="""
在好奇心方面，张三对李四的事情感兴趣（3，5）；最近打算从卖小吃转变为去做制造业（7）。这体现了张三对许多不同的事物都非常感兴趣。\n在审美能力方面，张三说自己喜欢新潮范儿的，巴洛克风格的建筑（13）。这体现了张三比较重视艺术与审美。\n在想象力方面，张三擅长哄王五开心（5，11），使用比喻非常恰当（4，22，24），能够想出创业的点子（10）。这体现了张三非常有创意，能想出新点子。\n综上所述，判断张三的性格特征为开放性高。
"""

conscientiousness_example="""
在条理性方面，张三尽管现在的职业是制造业，但是很看好餐饮产业，还考了餐饮证（7）。这体现了张三做事比较有计划。\n在效率性方面，张三虽然有点大脑缺氧，但最后还是陪齐李四去看爸妈（18）。这体现了张三比较能坚持把事情做完。\n在负责性方面，张三批评王五不应该一脚踩两船，做道德败坏的事（2），让田六多拿抽成（9）；会不用心记住李四吃的什么菜（11），有时满嘴跑火车（15）。这体现了张三比较可靠，总是值得他人信赖。\n综上所述，判断张三的性格特征为尽责性高。
"""

extraversion_example="""
在社交性方面，张三询问朋友的近况（7，23），提出与李四合伙开公司的想法（9），分享自己的故事（21，22），能够哄王五开心（11）。这体现了张三性格外向，非常喜欢交际。\n在果断性方面，张三批评田六做一脚踩两船道德败坏的事情（2），要求田六吃慢点（6），让李四重复旅游路线（8）。这体现了张三处于主导地位，非常像个领导一样。\n在活力水平方面，张三主动邀请李四去自己家看看，还主动提出送李四回家（4，12，14）。这体现了张三精力充沛，非常充满热情。\n综上所述，判断张三的性格特征为外向性高。
"""

agreeableness_example="""
在同情心方面，张三害怕自己伤了王五（16）；很心疼李四的妈妈（20，21）；关心王五的感情（1）。这体现了张三心肠非常柔软，有同情心。\n在谦恭性方面，张三尊重王五的感情（3），不欺负别人（9），说李四是自己的灯（11），对李四的好意表示感谢（12），坦诚自己的缺点（15），即使勉强也答应李四（18），夸赞王五说李总对王五特别崇拜（22）。这体现了张三为人恭谦，非常尊重他人。\n在信任度方面，张三哄李四不要生气（4），大方地情王五吃饭（6）；但也会不相信田六对故宫到八达岭的路线很熟悉（8）。这体现了张三比较宽宏大量。\n综上所述，判断张三的性格特征为宜人性高。
"""

neuroticism_example="""
在焦虑程度方面，张三对于王五去接刘飞的事情表现出了担忧（1，3，10），对自己与李四的感情生活十分紧张（14，17，18，20）。这体现了张三非常容易紧张，时常忧心忡忡，担心很多事情。\n在抑郁程度方面，张三对自己“旅游度假产业也将引领新的生活方式”这一判断十分坚定（7）。这体现了张三非常有安全感，对自己满意。\n在情绪稳定程度方面，面对其他人的质疑和批评，张三几乎不会生气（4，5，19）；有时对震撼的场面很有感触（21），对王五吃饭不雅而生气（6）。这体现了张三情绪比较稳定，不易生气。\n综上所述，判断张三的性格特征为神经质性低。
"""

example={
    "openness":openness_example,
    "conscientiousness":conscientiousness_example,
    "extraversion":extraversion_example,
    "agreeableness":agreeableness_example,
    "neuroticism":neuroticism_example
}