openness_definition="""
开放性主要由一个人的好奇心、审美能力和想象力3个子维度衡量。
开放性高的人通常表现出以下特征：
1. 好奇心
- 对许多不同的事物都感兴趣
- 思想深刻
2. 审美能力
- 着迷于艺术、音乐或文学
- 重视艺术与审美
3. 想象力
- 善于创造，能找到聪明的方法来做事
- 有创意，能想出新点子
开放性低的人通常表现出以下特征：
1. 好奇心
- 不喜欢知识性或者哲学性强的讨论
- 对抽象的概念和想法没什么兴趣
2. 审美能力
- 对艺术没有什么兴趣
- 觉得诗歌、戏剧很无聊
3. 想象力
- 几乎没有什么创造性
- 缺乏想象力
"""

conscientiousness_definition="""
尽责性主要由一个人的条理性、效率性和负责性3个子维度衡量。
尽责性高的人通常表现出以下特征：
1. 条理性
- 做事有计划有条理
- 习惯让事物保持整洁有序
2. 效率性
- 有效率，做事有始有终
- 有恒心，能坚持把事情做完
3. 负责性
- 可信赖的，可靠的
- 可靠的，总是值得他人信赖
尽责性低的人通常表现出以下特征：
1. 条理性
- 缺乏条理
- 乱糟糟的，不爱收拾
2. 效率性
- 比较懒
- 很难开始行动起来去完成一项任务
3. 负责性
- 有时比较没有责任心
- 有时候会做出一些不负责任的行为
"""

extraversion_definition="""
外向性主要由一个人的社交性、果断性和活力水平3个子维度衡量。
外向性高的人通常表现出以下特征：
1. 社交性
- 性格外向，喜欢交际
- 爱说话，健谈
2. 果断性
- 性格坚定自信，敢于表达自己的观点
- 常常处于主导地位，像个领导一样
3. 活力水平
- 精力充沛
- 充满热情
外向性低的人通常表现出以下特征：
1. 社交性
- 比较安静
- 有时会害羞，比较内向
2. 果断性
- 感觉自己很难对他人产生影响
- 更喜欢让别人来领头负责
3. 活力水平
- 很少觉得兴奋或者特别想要(做)什么
- 不如别人有活力
"""

agreeableness_definition="""
宜人性主要由一个人的同情心、谦恭性和信任度3个子维度衡量。
宜人性高的人通常表现出以下特征：
1. 同情心
- 心肠柔软，有同情心
- 乐于助人，待人无私
2. 谦恭性
- 为人恭谦，尊重他人
- 待人谦逊礼让
3. 信任度
- 宽宏大量
- 喜欢把人往最好的方面想
宜人性低的人通常表现出以下特征：
1. 同情心
- 对他人没有什么同情心
- 有时对人冷淡，漠不关心
2. 谦恭性
- 常与他人意见不和
- 有时对人比较粗鲁
3. 信任度
- 常常挑别人的毛病
- 不相信别人，怀疑别人的意图
"""

neuroticism_definition="""
神经质性主要由一个人的焦虑程度、抑郁程度和情绪稳定程度3个子维度衡量。
神经质性高的人通常表现出以下特征：
1. 焦虑程度
- 容易紧张
- 时常忧心忡忡，担心很多事情
2. 抑郁程度
- 时常觉得悲伤
- 时常觉得郁郁寡欢
3. 情绪稳定程度
- 喜怒无常，情绪起伏较多
- 情绪多变，容易愤怒
神经质性低的人通常表现出以下特征：
1. 焦虑程度
- 从容，善于处理压力
- 很少觉得焦虑或者害怕
2. 抑郁程度
- 经历挫折后仍能保持积极心态
- 觉得有安全感，对自己满意
3. 情绪稳定程度
- 情绪稳定，不易生气
- 能够控制自己的情绪
"""

definition={
    "开放性":openness_definition,
    "尽责性":conscientiousness_definition,
    "外向性":extraversion_definition,
    "宜人性":agreeableness_definition,
    "神经质性":neuroticism_definition
}